src/Catalogs/уатПрофилиОбменаСВнешнимиСистемами/уатПрофилиОбменаСВнешнимиСистемами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатПрофилиОбменаСВнешнимиСистемами</name>
  <comment>(уат)</comment>
  <predefined>
    <items>
      <name>Автодор</name>
      <description>Автодор</description>
    </items>
    <items>
      <name>Газпромнефть</name>
      <description>Газпромнефть</description>
    </items>
    <items>
      <name>Лукойл</name>
      <description>Лукойл</description>
    </items>
    <items>
      <name>ПлатонВыпискаОпераций</name>
      <description>Платон (Выписка операций)</description>
    </items>
    <items>
      <name>ПлатонЛогистическийОтчет</name>
      <description>Платон (Логистический отчет)</description>
    </items>
    <items>
      <name>ППР</name>
      <description>ППР</description>
    </items>
    <items>
      <name>Роснефть</name>
      <description>Топливные карты Роснефть</description>
    </items>
  </predefined>
  <attributes>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.уатВнешниеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаПоискаПЛДоВыезда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаПоискаПЛПослеВозвращения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменятьАналогНаОсновноеТопливо</name>
    <comment>Заменять аналог на основное топливо (уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментироватьХодВыполнения</name>
    <comment>(уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьРассчитанныеПутевыеЛисты</name>
    <comment>(уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьФормыЗаписанныхЗаправок</name>
    <comment>(уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчитатьПутевыеЛисты</name>
    <comment>(уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьНаличееДублейПоСозданнымРанееДокументам</name>
    <comment>(уат)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьСозданныеЗаправкиГСМ</name>
    <comment>(уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьСливыДляОтрицательныхЗаправок</name>
    <comment>(уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСистемы</name>
    <type>
      <types>EnumRef.уатТипыВнешнихСистем</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоответствияКолонок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоПроверенные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНаценкиСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеКолонок</name>
    <attributes>
      <name>КолонкаДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКолонкиФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолонкаДокументаПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКолонкиФайла</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользованиеВсегда</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/уатПрофилиОбменаСВнешнимиСистемами/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Ссылка = Справочники.уатПрофилиОбменаСВнешнимиСистемами.ППР 
		ИЛИ Ссылка = Справочники.уатПрофилиОбменаСВнешнимиСистемами.Лукойл
		ИЛИ Ссылка = Справочники.уатПрофилиОбменаСВнешнимиСистемами.Роснефть Тогда
		Возврат;
	КонецЕсли;
	
	НомерСтроки = 1;
	Для Каждого ТекСтрока Из СоответствиеКолонок Цикл
		Если ТипСоответствияКолонок = 0 Тогда
			Если ТекСтрока.Использование 
				И Не ЗначениеЗаполнено(ТекСтрока.ИмяКолонкиФайла) Тогда
				ТекстНСТР = НСтр("ru='Не заполнена колонка ""Имя колонки файла"" в строке %1 списка ""Соответствие колонок""'");
				ТекстСообщения = СтрШаблон(ТекстНСТР, НомерСтроки);
				уатОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения,"СоответствиеКолонок",НомерСтроки, "ИмяКолонкиФайла", Отказ);
			КонецЕсли;
		Иначе
			Если ТекСтрока.Использование 
				И Не ЗначениеЗаполнено(ТекСтрока.НомерКолонкиФайла) Тогда
				ТекстНСТР = НСтр("ru='Не заполнена колонка ""Номер колонки файла"" в строке %1 списка ""Соответствие колонок""'");
				ТекстСообщения = СтрШаблон(ТекстНСТР, НомерСтроки);
				уатОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения,"СоответствиеКолонок",НомерСтроки, "НомерКолонкиФайла", Отказ);
			КонецЕсли;
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
